In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('cars.csv')

In [5]:
df.sample(5)

         brand  km_driven    fuel         owner  selling_price
3499   Renault      40000  Petrol   First Owner         350000
7044  Mahindra      95000  Diesel  Second Owner         630000
282    Hyundai      63063  Petrol   First Owner         465000
1081     Volvo      20000  Diesel   First Owner        3800000
4210    Maruti      72000  Diesel   First Owner         400000

In [7]:
df.shape

(8128, 5)

In [11]:
df['brand'].value_counts()

brand
Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: count, dtype: int64

In [15]:
df['brand'].nunique()

32

<h1>1. One Hot Encoding using Pandas</h1>

In [44]:
new_df = pd.get_dummies(df, columns=['fuel','owner'], drop_first = True , dtype=np.int32)

In [46]:
new_df.head()

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0

In [48]:
new_df.shape

(8128, 10)

In [50]:
new_df.dtypes

brand                         object
km_driven                      int64
selling_price                  int64
fuel_Diesel                    int32
fuel_LPG                       int32
fuel_Petrol                    int32
owner_Fourth & Above Owner     int32
owner_Second Owner             int32
owner_Test Drive Car           int32
owner_Third Owner              int32
dtype: object

In [52]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   brand                       8128 non-null   object
 1   km_driven                   8128 non-null   int64
 2   selling_price               8128 non-null   int64
 3   fuel_Diesel                 8128 non-null   int32
 4   fuel_LPG                    8128 non-null   int32
 5   fuel_Petrol                 8128 non-null   int32
 6   owner_Fourth & Above Owner  8128 non-null   int32
 7   owner_Second Owner          8128 non-null   int32
 8   owner_Test Drive Car        8128 non-null   int32
 9   owner_Third Owner           8128 non-null   int32
dtypes: int32(7), int64(2), object(1)
memory usage: 412.9+ KB

<h1>2. One Hot Encoding using Sci-kit Learn (sklkearn)</h1>

In [57]:
from sklearn.model_selection import train_test_split

In [59]:
X_train, X_test, y_train, y_test = train_test_split(df.iloc[:,0:4], df.iloc[:,-1] , test_size = 0.2)

In [61]:
X_train.shape

(6502, 4)

In [63]:
X_train.head()

          brand  km_driven    fuel        owner
2577  Chevrolet      70000  Diesel  Third Owner
3653       Tata      50000  Petrol  First Owner
3246       Tata      58000  Diesel  First Owner
1643    Hyundai     118000  Diesel  First Owner
2597  Chevrolet      35000  Petrol  First Owner

In [65]:
y_train.head()

2577     160000
3653     350000
3246    1295000
1643     270000
2597     310000
Name: selling_price, dtype: int64

In [67]:
from sklearn.preprocessing import OneHotEncoder

In [77]:
ohe = OneHotEncoder(drop='first',sparse_output=False,dtype = np.int32 )

In [83]:
x_train_ohe = ohe.fit_transform(X_train[['fuel','owner']])

In [85]:
x_test_ohe = ohe.fit_transform(X_test[['fuel','owner']])

In [87]:
x_train_ohe.shape

(6502, 7)

In [93]:
x_train_final = np.hstack((X_train[['brand','km_driven']].values , x_train_ohe))

In [99]:
x_train_final

array([['Chevrolet', 70000, 1, ..., 0, 0, 1],
       ['Tata', 50000, 0, ..., 0, 0, 0],
       ['Tata', 58000, 1, ..., 0, 0, 0],
       ...,
       ['Chevrolet', 53319, 1, ..., 0, 0, 0],
       ['Hyundai', 130000, 1, ..., 0, 0, 0],
       ['Mahindra', 15000, 0, ..., 1, 0, 0]], dtype=object)